In [1]:
%autosave 0

Autosave disabled

In [2]:
import pandas as pd
import numpy as np

from sklearn.linear_model import LogisticRegression
from adam_prepare import titanic_pipeline

Let's read in the data using the titanic pipeline function!

In [3]:
train, val, test = titanic_pipeline()
train.head()

,survived,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,0,19.0,1,0,53.1000,0,True,True,False,False,False,False,True
45,0,29.0,0,0,8.0500,1,True,False,False,True,False,False,True
28,1,29.0,0,0,7.8792,1,False,False,False,True,False,True,False
633,0,29.0,0,0,0.0000,1,True,True,False,False,False,False,True
403,0,28.0,1,0,15.8500,0,True,False,False,True,False,False,True

Let's define a function to create X and y splits of our data.

In [4]:
def xy_split(df):
    
    return df.drop(columns = ['survived']), df.survived

In [5]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()

,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,19.0,1,0,53.1000,0,True,True,False,False,False,False,True
45,29.0,0,0,8.0500,1,True,False,False,True,False,False,True
28,29.0,0,0,7.8792,1,False,False,False,True,False,True,False
633,29.0,0,0,0.0000,1,True,True,False,False,False,False,True
403,28.0,1,0,15.8500,0,True,False,False,True,False,False,True

Now it's time to build our [LogisticRegression](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html) model!

In [6]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400)

logreg.fit(X_train, y_train)

logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.7993579454253612, 0.8507462686567164)

In [7]:
logreg.coef_

array([[-0.04106443, -0.49195125, -0.17727728,  0.0025756 , -0.61854092,
        -2.47800535,  0.99573809,  0.0723964 , -0.9921234 , -0.15497786,
         0.20472436, -0.4240927 ]])

In [8]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

                    feature  coefficient
0                       age    -0.041064
1                     sibsp    -0.491951
2                     parch    -0.177277
3                      fare     0.002576
4                     alone    -0.618541
5                  sex_male    -2.478005
6               class_First     0.995738
7              class_Second     0.072396
8               class_Third    -0.992123
9     embark_town_Cherbourg    -0.154978
10   embark_town_Queenstown     0.204724
11  embark_town_Southampton    -0.424093

In [11]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400,
                           solver = 'liblinear', penalty = 'l1')

logreg.fit(X_train,y_train)
logreg.score(X_train,y_train) , logreg.score(X_val,y_val)

(0.8009630818619583, 0.8507462686567164)

In [12]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

                    feature  coefficient
0                       age    -0.038327
1                     sibsp    -0.418894
2                     parch    -0.136355
3                      fare     0.002931
4                     alone    -0.434766
5                  sex_male    -2.530612
6               class_First     1.966966
7              class_Second     1.009704
8               class_Third     0.000000
9     embark_town_Cherbourg     0.000000
10   embark_town_Queenstown     0.269433
11  embark_town_Southampton    -0.223258